{
  "_name_or_path": "t5-small",
  "architectures": [
    "T5WithLMHeadModel"
  ],
  "benepar": {
    "char_vocab": null,
    "hparams": {
      "attention_dropout": 0.2,
      "batch_size": 32,
      "char_lstm_input_dropout": 0.2,
      "checks_per_epoch": 4,
      "clip_grad_norm": 0.0,
      "d_char_emb": 64,
      "d_ff": 2048,
      "d_kv": 64,
      "d_label_hidden": 256,
      "d_model": 1024,
      "d_tag_hidden": 256,
      "encoder_max_len": 512,
      "force_root_constituent": true,
      "learning_rate": 5e-05,
      "learning_rate_warmup_steps": 160,
      "max_consecutive_decays": 3,
      "max_len_dev": 0,
      "max_len_train": 0,
      "morpho_emb_dropout": 0.2,
      "num_heads": 8,
      "num_layers": 2,
      "predict_tags": true,
      "pretrained_model": "t5-small",
      "relu_dropout": 0.1,
      "residual_dropout": 0.2,
      "step_decay_factor": 0.5,
      "step_decay_patience": 5,
      "tag_loss_scale": 5.0,
      "use_chars_lstm": false,
      "use_encoder": true,
      "use_pretrained": true
    },
    "label_vocab": {
      "": 0,
      "ADJ": 1,
      "ADJP": 2,
      "ADJP::ADJP": 3,
      "ADJP::ADVP": 4,
      "ADJP::QP": 5,
      "ADVP": 6,
      "ADVP::ADJP": 7,
      "ADVP::ADVP": 8,
      "ADVP::NML": 9,
      "ADVP::PRT": 10,
      "CONJP": 11,
      "FRAG": 12,
      "FRAG::ADJP": 13,
      "FRAG::ADVP": 14,
      "FRAG::INTJ": 15,
      "FRAG::NP": 16,
      "FRAG::PP": 17,
      "FRAG::S": 18,
      "FRAG::S::ADJP": 19,
      "FRAG::S::VP": 20,
      "FRAG::SBAR": 21,
      "FRAG::SBAR::WHNP": 22,
      "FRAG::SBARQ": 23,
      "FRAG::UCP": 24,
      "FRAG::VP": 25,
      "FRAG::WHADVP": 26,
      "FRAG::WHNP": 27,
      "FRAG::WHPP": 28,
      "INTJ": 29,
      "INTJ::S": 30,
      "LST": 31,
      "NAC": 32,
      "NML": 33,
      "NML::ADVP": 34,
      "NML::FRAG": 35,
      "NML::NML": 36,
      "NML::PP": 37,
      "NML::QP": 38,
      "NML::S": 39,
      "NML::S::VP": 40,
      "NML::SBAR": 41,
      "NML::SQ": 42,
      "NP": 43,
      "NP::ADJP": 44,
      "NP::ADVP": 45,
      "NP::FRAG": 46,
      "NP::INTJ": 47,
      "NP::NML": 48,
      "NP::NML::PP": 49,
      "NP::NP": 50,
      "NP::NP::ADJP": 51,
      "NP::NP::NP": 52,
      "NP::NP::QP": 53,
      "NP::PP": 54,
      "NP::QP": 55,
      "NP::S": 56,
      "NP::S::VP": 57,
      "NP::SBAR": 58,
      "NP::SBAR::S::VP": 59,
      "PP": 60,
      "PP::NP": 61,
      "PP::PP": 62,
      "PP::X": 63,
      "PRN": 64,
      "PRN::S": 65,
      "PRN::S::VP": 66,
      "PRN::SBAR": 67,
      "PRN::SINV": 68,
      "PRT": 69,
      "QP": 70,
      "QP::ADVP": 71,
      "RRC": 72,
      "RRC::VP": 73,
      "S": 74,
      "S::ADJP": 75,
      "S::ADVP": 76,
      "S::NP": 77,
      "S::NP::NML": 78,
      "S::NP::NP": 79,
      "S::PP": 80,
      "S::S": 81,
      "S::UCP": 82,
      "S::VP": 83,
      "S::VP::ADVP": 84,
      "S::VP::VP": 85,
      "SBAR": 86,
      "SBAR::FRAG": 87,
      "SBAR::S": 88,
      "SBAR::S::NP": 89,
      "SBAR::S::VP": 90,
      "SBAR::SBAR::S": 91,
      "SBAR::SINV": 92,
      "SBAR::WHADJP": 93,
      "SBAR::WHADVP": 94,
      "SBAR::WHNP": 95,
      "SBARQ": 96,
      "SBARQ::FRAG": 97,
      "SBARQ::WHADVP": 98,
      "SBARQ::WHNP": 99,
      "SINV": 100,
      "SQ": 101,
      "SQ::VP": 102,
      "UCP": 103,
      "UCP::PP": 104,
      "VP": 105,
      "VP::ADVP": 106,
      "VP::FRAG::ADJP": 107,
      "VP::NP": 108,
      "VP::PP": 109,
      "VP::SBAR": 110,
      "VP::VP": 111,
      "WHADJP": 112,
      "WHADVP": 113,
      "WHNP": 114,
      "WHNP::QP": 115,
      "WHNP::WHNP": 116,
      "WHPP": 117,
      "X": 118,
      "X::ADVP": 119,
      "X::NP": 120,
      "X::PP": 121,
      "X::SBARQ": 122,
      "X::VP": 123
    },
    "tag_vocab": {
      "$": 1,
      "''": 2,
      ",": 3,
      "-LRB-": 4,
      "-RRB-": 5,
      ".": 6,
      ":": 7,
      "AFX": 8,
      "CC": 9,
      "CD": 10,
      "DT": 11,
      "EX": 12,
      "FW": 13,
      "HYPH": 14,
      "IN": 15,
      "JJ": 16,
      "JJR": 17,
      "JJS": 18,
      "LS": 19,
      "MD": 20,
      "NFP": 21,
      "NN": 22,
      "NNP": 23,
      "NNPS": 24,
      "NNS": 25,
      "PDT": 26,
      "POS": 27,
      "PRP": 28,
      "PRP$": 29,
      "RB": 30,
      "RBR": 31,
      "RBS": 32,
      "RP": 33,
      "SYM": 34,
      "TO": 35,
      "UH": 36,
      "UNK": 0,
      "VB": 37,
      "VBD": 38,
      "VBG": 39,
      "VBN": 40,
      "VBP": 41,
      "VBZ": 42,
      "WDT": 43,
      "WP": 44,
      "WP$": 45,
      "WRB": 46,
      "``": 47
    }
  },
  "d_ff": 2048,
  "d_kv": 64,
  "d_model": 512,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "relu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 6,
  "num_heads": 8,
  "num_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_num_buckets": 32,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 2.0,
      "max_length": 200,
      "min_length": 30,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "summarize: "
    },
    "translation_en_to_de": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to German: "
    },
    "translation_en_to_fr": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to French: "
    },
    "translation_en_to_ro": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to Romanian: "
    }
  },
  "transformers_version": "4.2.2",
  "use_cache": true,
  "vocab_size": 32128
}
